#include <stdio.h>

// Сколько раз встречается максимум
// На стандартном потоке ввода задаётся натуральное число N (N > 0),
// после которого следует последовательность из N целых чисел.На стандартный поток вывода напечатайте,
// сколько раз в этой последовательности встречается максимум. Указание: использовать массивы запрещается.

// Examples
// Input
// 6 1 2 3 2 0 3
// Output
// 2
// Input
// 3 5 2 -1
// Output
// 1



int main(void) 
{
    int n;
    scanf("%d", &n); // читаем количество чисел

    int max_number = -2147483648; // минимальное значение для int
    int max_count; // количество максимальных чисел
    int tmp; // переменная для сохранения промежуточных значений
    for (int i = 0; i < n; i++)
    {
        scanf("%d", &tmp);
        if(tmp > max_number)
        {
            max_count = 1;
            max_number = tmp;
        }
        else if(tmp == max_number)
            ++max_count;
    }
    printf("%d\n", max_count);
    return 0;
}