#include <stdio.h>

// Шифр Цезаря

// На стандартном потоке ввода задается целое неотрицательное число N
// и последовательность допустимых символов в кодировке ASCII, оканчивающаяся точкой.
// Допустимые символы - латинские буквы 'a' ... 'z', 'A' ... 'Z' и пробел.
// Требуется закодировать латинские буквы ('a' ... 'z', 'A' ... 'Z') шифром Цезаря,
// пробелы вывести без изменения. Число N задает сдвиг в шифре. Шифр Цезаря заключается в следующем преобразовании.
// Пусть буквы алфавита пронумерованы от 0 до K - 1, где K - число символов в алфавите.
// Тогда символ с номером n кодируется символом с номером p = (n + N) mod K (mod - операция взятия остатка).
// На стандартном потоке вывода напечатать зашифрованное сообщение, оканчивающееся точкой.
// Преобразование требуется выполнять независимо для заглавных и строчных латинских букв.
// Указание: использовать массивы запрещается.



int main(void) 
{
    int shift; // сдвиг для шифра Цезаря
    int flag = 1;
    char symbol = 0; // символ или пробелж    
    scanf("%d", &shift); // сохраняем сдивг
    shift %= 26; // 26 число букв в англ. алфавите, если число больше 26 то вычисляем остаток от диления на 26
    
    while (symbol != '.')
    {
        scanf("%c", &symbol);
        if(symbol >= 'a' && symbol <= 'z')
            printf("%c", symbol + shift > 'z' ? 'a' + ((symbol + shift - 'a') % 26) : symbol + shift); // печатаем символ со здвигом
        else if(symbol >= 'A' && symbol <= 'Z')
            printf("%c", symbol + shift > 'Z' ? 'A' + ((symbol + shift - 'A') % 26) : symbol + shift); // печатаем символ со здвигом
        else if(flag)
            flag = 0;
        else
            printf("%c", symbol); // печатаем пробел
        flag = 0;

    }

    printf("\n");
    return 0;
}