#include <stdio.h>
#include <stdint.h>

// Инверсия старших
// На вход программе подается беззнаковое 32-битное целое число N.
// Требуется изменить значения всех битов старшего байта числа на противоположные и вывести полученное таким образом число.

// Examples
// Input
// 1
// Output
// 4278190081
// Input
// 4278190081
// Output
// 1
// Input
// 2739690055
// Output
// 1548507719



int main(void) 
{
    uint32_t n;
    scanf("%d", &n);
    printf("%u\n",  (~ n >> 24 << 24) | (n << 8 >> 8));
    return 0;
}